/*******************************************************************************
* Copyright 2015, 浙江正元智慧科技股份有限公司
* All right reserved
*
* 文件名称：sam.h
*
* 文件标识：psam
* 摘    要：psam基于串口1驱动的接口功能函数集合
*
*
* 当前版本：V1.0
* 作    者：wcp
* 完成日期：2015/8/21
* 编译环境：D:\Program Files (x86)\IAR Systems\Embedded Workbench 6.5\arm
*
* 历史信息：
*******************************************************************************/

#ifndef __SAM_H
#define __SAM_H

#ifdef __cplusplus
extern "C" {
#endif

#include "../config.h"

void UartSAM_SendSET(void);

void UartSAM_RecvSET(void);

//C 控制串口TXD/RXD B接地 CD4052 AB=00=0X0Y AB=10=1X1Y
//AB 控制SAM卡选择、上电、复位 AB=00=0X0Y 第一片SAM卡
/**********************************************函数定义*****************************************************
* 函数名称: void SAM_Init(u8 BaudID)
* 输入参数: u8 BaudID  BaudID 0=9600bps 1=38400bps 2=57600bps 3=115200bps
* 返回参数: void
* 功    能: SAM卡串口初始化
* 作    者: by wcp
* 日    期: 2015/9/6
************************************************************************************************************/
u8 SAM_Init(u8 BaudID);

/**********************************************函数定义*****************************************************
* 函数名称: void SAMUart_Init(u8 BaudID)
* 输入参数: u8 BaudID  BaudID 0=9600bps 1=38400bps 2=57600bps 3=115200bps
* 返回参数: void
* 功    能: SAM卡串口初始化
* 作    者: by wcp
* 日    期: 2015/9/6
************************************************************************************************************/
u8 SAMUart_Init(u8 BaudID);

/**********************************************函数定义*****************************************************
* 函数名称: u8  SAM_RESET(u8 *bRespData,u8 *length)
* 输入参数: u8 Index Index 1/2/3/4卡座,u8 *bRespData 复位返回数据,u8 *length 返回数据长度
* 返回参数: u8   0：成功 1：失败
* 功    能: SAM卡复位
* 作    者: by wcp
* 日    期: 2015/9/6
************************************************************************************************************/
u8 SAM_SelectRESET(u8 Index, u8 *bRespData, u8 *length);

/**********************************************函数定义*****************************************************
* 函数名称: u8 UartSAM_SendData(u8 *data,u8 len)
* 输入参数: u8 *data 发送的数据 ,u8 len 发送数据的长度
* 返回参数: u8
* 功    能: SAM卡串口发送数据  （使用串行发送）
* 作    者: by wcp
* 日    期: 2015/9/6
************************************************************************************************************/
u8 UartSAM_SendDataD(u8 *data, u16 len);

u8 UartSAM_SendData(u8 *data, u8 len);

/**********************************************函数定义*****************************************************
* 函数名称: u8 UartSAM_RecvData(u8 *data,u8 *RecvLen,u32 wait_time)
* 输入参数: u8 *data 接收到的数据, u8 *RecvLen 接收到的数据长度, u32 wait_time 接收数据时超时时间
* 返回参数: u8  0成功 1失败
* 功    能: SAM卡 串口接收数据(中断接收)
* 作    者: by wcp
* 日    期: 2015/9/6
************************************************************************************************************/
u8 UartSAM_RecvData(u8 *data, u8 *RecvLen, u32 wait_time);

/**********************************************函数定义*****************************************************
* 函数名称: long  SAM_EXCHANGE_APDU(u8 *APDU_Buf,long APDU_Len,u8r *response,u8 *data_len,long wait_time)
* 输入参数: u8 *APDU_Buf,long APDU_Len,u8r *response,u8 *data_len,long wait_time
* 返回参数: long
* 功    能: SAM卡发送APDU指令
* 作    者: by wcp
* 日    期: 2015/12/2
************************************************************************************************************/
u8 SAM_EXCHANGE_APDU(u8 *APDU_Buf, long APDU_Len, u8 *response, u8 *data_len, long wait_time);

#ifdef __cplusplus
}
#endif
#endif



